<div># دليل استخدام Markdown</div>
<div>Markdown هي طريقة بسيطة لتنسيق النصوص باستخدام رموز خاصة لإنشاء محتوى منسق. إليك الأساسيات:</div>
<div>&nbsp;</div> <!-- Empty line -->

<div>## العناوين</div>
<div>لإضافة عنوان، استخدم علامة `#` متبوعة بالنص. يمكنك إضافة المزيد من علامات `#` لتغيير مستوى العنوان.</div>
<div># العنوان الأول</div>
<div>## العنوان الثاني</div>
<div>### العنوان الثالث</div>
<div>&nbsp;</div> <!-- Empty line -->

<div>## النصوص الغامقة والمائلة</div>
<div>- لجعل النص **سميكاً**، استخدم نجمتين قبل وبعد النص:</div>
<div>**سميك**</div>
<div>- لجعل النص *مائلًا*، استخدم نجمة واحدة قبل وبعد النص:</div>
<div>_مائل_</div>
<div>&nbsp;</div> <!-- Empty line -->

<div>## الروابط</div>
<div>لإضافة رابط، استخدم الأقواس المربعة للعنوان والأقواس العادية للرابط:</div>
<div>[هذا رابط](الرابط)</div>
<div>&nbsp;</div> <!-- Empty line -->

<div>## القوائم</div>
<div>لإضافة قائمة نقطية، استخدم علامة `-` أو `*`:</div>
<div>- العنصر الأول</div>
<div>- العنصر الثاني</div>
<div>- العنصر الثالث</div>
<div>لإضافة قائمة رقمية، استخدم الأرقام متبوعة بنقطة:</div>
<div>1. العنصر الأول</div>
<div>2. العنصر الثاني</div>
<div>3. العنصر الثالث</div>
<div>&nbsp;</div> <!-- Empty line -->

<div>لإضافة قائمة تحقق، استخدم قوسين مربعين :</div>
<div>- [ ] العنصر الأول</div>
<div>- [x] العنصر الثاني</div>
<div>- [ ] العنصر الثالث</div>
<div>&nbsp;</div> <!-- Empty line -->

<div>## الصور</div>
<div>لإضافة صورة، استخدم علامة `!` قبل الأقواس المربعة:</div>
<div>![اسم الصورة](https://img.freepik.com/premium-photo/mosque-alaqsa-dome-rock-mosquejerusalem-al-quds-3d-rendering-palestinian_582688-1732.jpg?w=826)</div>
<div>&nbsp;</div> <!-- Empty line -->

<div>## إضافة سطر جديد</div>
<div>لإضافة سطر جديد، استخدم علامتي تعجب في نهاية السطر:</div>
<div>هذه الجملة الأولى !!</div>
<div>وهذه الجملة الثانية</div>